# St7GetPathFill

Returns the fill colour scheme for load paths.

long St7GetPathFill(long uID, long* Fill)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Fill

One of tfNone, tfTemplate, tfGroup, tfPathNumber, tfColour or tfOrientation.